import React from 'react';

const PoliciesPage: React.FC = () => {
    return (
        <div className='policies-page'>
            <div className='policies__text-wrapper'>
                <h1>Пользовательское соглашение (оферта)</h1>
                <p>Добро пожаловать!</p>
                <p>Этот сайт, включая его мобильную версию, приложение (далее — «Cайт»), предназначен для оказания помощи клиентам в поиске и сборе информации о путешествии, определении наличия связанных с поездкой услуг, оказываемых соответствующими поставщиками, их бронирования и/или покупки, и ни для каких других целей.</p>

                <p>В данном соглашении используются следующие термины:</p>
                <p>«Мы», «нам», «наш», «Компания» и «ReactHotel» относятся к компании ООО "Реакт Хотел" (ОГРН 1127746124989), адрес: Томск, ул. Гагарина, дом 11, офис 101.</p>
                <p>«Вы», «Вам», «Ваши», «Пользователь» и «Клиент» относятся к пользователю, посетившему данный Cайт и/или разместившему заказ на услуги Поставщиков через данный Сайт. Клиентом является дееспособное физическое лицо, достигшее совершеннолетия в соответствии с применимым законодательством, имеющее законное право вступать в договорные отношения с OneTwoTrip. К Клиенту также относится лицо, указанное в Заказе в качестве получателя услуг.</p>
                <p>«Заказ» относится к заявке Клиента на Сайте либо через службу поддержки Компании на бронирование или оплату услуг Поставщиков.</p>
                <p>«Отель» относится к номеру в гостинице, отеле, хостеле, апартаменту, вилле и другому объекту размещения для проживания Клиента.</p>

                <p>«Поставщик» относится к лицу, непосредственно оказывающему услуги по перевозке, аренде автомобиля, гостиничные услуги и иные дополнительные услуги, агенты указанных организаций, а также организации, предоставляющие возможность бронирования и оплаты указанных услуг, с которым OneTwoTrip заключил соглашение на оказание соответствующих услуг.</p>

                <p>«Система бронирования» относится к информационной системе, принадлежащей третьим лицам и содержащей сведения о расписании авиарейсов, наличии мест на авиарейсы, тарифах перевозчиков, правилах их применения, наличии номерного фонда в объектах размещения и проживания, стоимости номеров, правилах заселения и проживания, правила оказания услуг по ж/д перевозке, а также другие условия оказания Поставщиками услуг.</p>

                <p>«Соглашение» - изложенные ниже термины и условия, регулирующие отношения между Клиентом и ReactHotel.</p>

                <p>Мы предлагаем на Ваше одобрение без каких-либо изменений данное Соглашение. Пожалуйста, ознакомьтесь внимательно с настоящим Соглашением. Если Вы не принимаете все условия и пункты настоящего Соглашения, пожалуйста, не используйте этот Сайт.</p>

                <p>С того момента как Клиент открывает любую страницу Сайта или использует любой сервис данного Сайта, Клиент подтверждает полное и безоговорочное принятие изложенных ниже условий, и Соглашение вступает в силу.</p>

                <p>Мы оставляем за собой право в любое время изменять и/или дополнять по нашему усмотрению данное Соглашение без предварительного уведомления, такие изменения имеют обратную силу и применяются к Вашим правоотношениям с Компанией с момента их возникновения. Клиент обязуется самостоятельно регулярно отслеживать изменения в Соглашении. Дальнейшее использование Сайта означает Ваше согласие с возможными обновлениями и изменениями, которые могут быть внесены в Соглашение.</p>

                <h2>Условия использования сайта</h2>
                <p>В соответствии с условиями использования данного Сайта Вы подтверждаете, что:</p>

                <ul>
                    <li>Вы достигли совершеннолетия, Вы дееспособны, правоспособны, имеете законное право вступать в договорные отношения с ReactHotel и будете использовать Сайт в соответствии с настоящим Соглашением;</li>
                    <li>вся информация, предоставляемая Вами, является правдивой, точной, актуальной и полной; при бронировании и покупке услуг Поставщиков для третьих лиц, от имени которых Вы имеете право осуществлять данные действия, Вы должны информировать этих лиц обо всех условиях, правилах и выбранной услуги, а также обо всех возможных изменениях, связанных с произведённым бронированием/покупкой;</li>
                    <li>при бронировании и покупке услуг Поставщиков для себя и/или других лиц Вы соглашаетесь не осуществлять дублирование броней и заказов;</li>
                    <li>принимаете на себя все коммерческие риски (оплата штрафов, сбора агента, оформление нового заказа на услуги Поставщиков и т.п.) при использовании Сайта.</li>
                </ul>
                
                <p>Клиент подтверждает и гарантирует, что самостоятельно ознакомился, понимает и согласен с:</p>
                <ul>
                    <li>требованиями к документам, необходимым для бронирования, оплаты и пользования услугами Поставщиков, и обязуется самостоятельно обеспечить их подготовку;</li>
                    <li>правилами и условиями оказания услуг Поставщиков;</li>
                    <li>правилами пограничного (таможенного) контроля (режима);</li>
                    <li>правилами обслуживания банковских продуктов и иных средств платежа, используемых для оплаты услуг Поставщиков;</li>
                    <li>применимым законодательством включая санитарно-эпидемиологические требования (необходимость наличия теста, прививки, QR-кода, средства индивидуальной защиты и т.д.) и обязуется их соблюдать.</li>
                </ul>
                <h2>Политика конфиденциальности</h2>
                <p>Мы понимаем, что процесс онлайн-бронирования и совершения покупок на Сайте предполагает значительный уровень доверия с Вашей стороны.</p>
                <p>При регистрации на Сайте, а также при оформлении заказа Пользователь предоставляет свое согласие на обработку персональных данных, необходимых для оформления заказа. В случае если Пользователь не желает, чтобы его персональные данные обрабатывались, то он обязуется направить в компанию ReactHotel сообщение об отзыве своего согласия. Обращаем Ваше внимание, что при отзыве согласия Пользователь не сможет размещать заказы на Сайте.</p>
        </div>
    </div>
        
    );
};

export default PoliciesPage;